Mycek_15TI/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (   0.0  -0.0  -2.0   )  //  point#  0
    (  18.0  -0.0  -2.0   )  //  point#  1
    (  18.0   2.0  -2.0   )  //  point#  2 
    (   0.0   2.0  -2.0   )  //  point#  3

    (   0.0  -0.0   0.0   )  //  point#  4
    (  18.0  -0.0   0.0   )  //  point#  5
    (  18.0   2.0   0.0   )  //  point#  6 
    (   0.0   2.0   0.0   )  //  point#  7

    (   0.0  -0.0   0.5   )  //  point#  8
    (  18.0  -0.0   0.5   )  //  point#  9
    (  18.0   2.0   0.5   )  //  point#  10
    (   0.0   2.0   0.5   )  //  point#  11
);

blocks
(
    hex (0 1 2 3 4 5 6  7 ) (360 40 40) simpleGrading (1 1 1)
    hex (4 5 6 7 8 9 10 11) (360 40 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    In
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    aboveIn
    {
        type patch;
        faces
        (
            (4 8 11 7)
        );
    }

    Out
    {
        type patch;
	    faces
        (
            (1 2 6 5)
            //(5 6 10 9) //above outlet
        );
    }

    aboveOut
    {
        type patch;
        faces
        (
            (5 6 10 9)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (8 9 10 11) //top
        );
    }

    sides
    {
	type wall;
	faces
        (
            (2 3 7  6 ) //backwall water
            (6 7 11 10) //backwall air
            (0 1 5 4)  //frontwall water
            (4 5 9 8)  //frontwall air
            (0 3 2 1)  //lowerWall
        );
    }
   
);

edges
(
);

mergePatchPairs
(
);

// ************************************************************************* //
