Mycek_15TI/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

#include        "include/initialConditions"

internalField   uniform $flowVelocity;

boundaryField
{
    In  
    {
       type             fixedValue; 
       value            $internalField;
    }
    aboveIn       
    {
       type             fixedValue; 
       value            $internalField;
    }
    
    Out 
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }
    aboveOut
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }
   
    atmosphere
    {
        type            zeroGradient;
    }
    
    sides
    {
        type            slip;
    }
    defaultFaces
    {
        type            empty;
    }

}


// ************************************************************************* //
