Mycek_15TI/0.org/alpha.water.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    In
    {
        type            fixedValue;
        value           uniform 1;
    }
    
    aboveIn
    {
       type        inletOutlet; //lets only air back into the domain
       inletValue  uniform 0;
       value       uniform 0;
    }

    Out
    {
       type        inletOutlet; //let only water back into domain
       inletValue  uniform 1;
       value       uniform 0;
    }
    aboveOut
    {
        type        inletOutlet; //let only air back in
        inletValue  uniform 0;
        value       uniform 0;
    }

    sides
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            inletOutlet; //let only air back in
        inletValue      uniform 0;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }

}

// ************************************************************************* //
