Mycek_15TI/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

#include        "include/initialConditions"

internalField   uniform $turbulentEpsilon;

boundaryField
{
    In
    {
        type            fixedValue;
        value          uniform $turbulentEpsilon; 
    }
    aboveIn
    {
        type            fixedValue;
        value          uniform $turbulentEpsilon; 
    }
    
    Out
    {
         type            zeroGradient;
    }
    aboveOut
    {
         type            zeroGradient;
    }
    
    atmosphere
    {
         type            zeroGradient;
    }
    sides
    {
        type            slip;
    }
    defaultFaces
    {
        type            empty;
    }

}


// ************************************************************************* //
