Mycek_15TI/0.org/include/sideAndTopPatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

//top
//{
//    type empty;
//}
//
//bottom
//{
//    type empty;
//}

"proc.*"
{
    type            processor;
}

// ************************************************************************* //
