Mycek_15TI/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "initialConditions"


MomSource1
{
    type            actuationDiskSourceU;
    active          on;            //on/off switch

    actuationDiskSourceUCoeffs
    {
        selectionMode   cellSet;       //cellSet // points //cellZone
        cellSet         actuatorDisk;  //cellSet name when selectionMode = cellSet
        fieldNames      (U);
        diskDir         $diskDir;      // orientation of the disk
        Ct              $Ct;           // Ct
        diskArea        $diskArea;     // disk area 
    }
}

TKESource1
{
    type            actuationDiskSourceK;
    active          on;            //on/off switch

    actuationDiskSourceKCoeffs
    {
        selectionMode   cellSet;       //cellSet // points //cellZone
        cellSet         actuatorDisk;  //cellSet name when selectionMode = cellSet
        fieldNames  (k);
        diskDir     $diskDir;
        Ct          $Ct;
        Bp          $Bp;
        Bd          $Bd;
        diskArea    $diskArea;
    }
}

EpsSource1
{
    type            actuationDiskSourceEpsilon;
    active          on;            //on/off switch

    actuationDiskSourceEpsilonCoeffs
    {
        selectionMode   cellSet;       //cellSet // points //cellZone
        cellSet         actuatorDisk;  //cellSet name when selectionMode = cellSet
        fieldNames  (epsilon);
        diskDir     $diskDir;
        Ct          $Ct;
        Bp          $Bp;
        Bd          $Bd;
        Ce4         $Ce4;
        Ce5         $Ce5;
        diskArea    $diskArea;
    }
}

// ************************************************************************* //
