Mycek_15TI/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Add for OpenFOAM 5.0+
type sets;
libs ("libsampling.so");


setFormat csv; 

interpolationScheme cellPoint; 

sets 
 ( 
    TI15
    { 
        type        cloud; 
        axis        x; 
        points      ( ( 6.84 0.0 -1.0 )
                      ( 7.4  0.0 -1.0 )
                      ( 8.1  0.0 -1.0 )
                      ( 8.8  0.0 -1.0 )
                      ( 9.5  0.0 -1.0 ) 
                      ( 10.2 0.0 -1.0 )
                      ( 10.9 0.0 -1.0 )
                      ( 11.6 0.0 -1.0 )
                      ( 12.3 0.0 -1.0 )
                      ( 13.0 0.0 -1.0 ) );  
    }


);

fields 
(
    U
    k
); 



// *********************************************************************** // 
